/*8) Напишите две функции, находящие приближенное значение квадратного и
кубического корня. В программе не должны использоваться математические
библиотеки*/
#include <iostream>

using namespace std;

int main()
{
    cout << "¯\_(ツ)_/¯" << endl;
    return 0;
}
